{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Drafts",
    "description": "",
    "home_page_url": "https://deftdraft.com/blog",
    "feed_url": "https://deftdraft.com/blog/feed.json",
    "user_comment": "",
    "author": {
        "name": "Matt L"
    },
    "items": [
        {
            "id": "https://deftdraft.com/blog/3-reasons-screen-detoxes-dont-last-and-what-does/",
            "url": "https://deftdraft.com/blog/3-reasons-screen-detoxes-dont-last-and-what-does/",
            "title": "3 Reasons Screen Detoxes Don&#x27;t Last (And What Does)",
            "summary": "You’ve probably done this before. Maybe more than once. You announce the detox—to yourself, to a friend, maybe on social media. You delete the apps. You set the phone in a drawer. The first few days feel incredible. Clearer head. More time. A sense of&hellip;",
            "content_html": "<p>You’ve probably done this before. Maybe more than once.</p><p>You announce the detox—to yourself, to a friend, maybe on social media. You delete the apps. You set the phone in a drawer. The first few days feel incredible. Clearer head. More time. A sense of control you forgot you could have.</p><p>Then a week passes. Maybe two. The edges soften. You check “just once.” Then once becomes a habit again. And before long, you’re back where you started—except now you also feel like a failure.</p><p>Screen detoxes don’t fail dramatically. They fade. Slowly, predictably, almost invisibly. And then you’re left wondering what’s wrong with you.</p><p>Nothing’s wrong with you. The detox was structurally designed to fail. Here’s why.</p><h2 id=\"the-honeymoon-is-realbut-it-lies\">The Honeymoon Is Real—But It Lies</h2>\n<p>Detoxes feel convincing at first because they deliver real relief.</p><p>The overstimulation drops. The noise clears. You suddenly have gaps in your day that used to be filled with scrolling, and the silence feels almost luxurious. There’s a novelty spike to being “someone who doesn’t use their phone.” The rules are clear, the identity is clean, and for a few days, it works.</p><p>But short-term relief is not the same as a sustainable system.</p><p>Detoxes feel good because they temporarily remove the noise. But they also expose what the noise was covering. That’s useful information—if you know what to do with it.</p><p>The honeymoon phase is powered by willpower, novelty, and the temporary thrill of self-control. None of those resources regenerate indefinitely. The moment life gets stressful or boring or ambiguous, the detox starts leaking.</p><p>That’s not failure. That’s physics.</p><h2 id=\"reason-1-detoxes-remove-the-tool-not-the-function\">Reason #1: Detoxes Remove the Tool, Not the Function</h2>\n<p>Your phone isn’t just entertainment. It’s regulation, connection, orientation, escape, filler. It’s how you manage boredom, soothe anxiety, avoid hard tasks, check whether you’re missing something. It’s doing six jobs, most of them invisible.</p><p>A detox removes the tool. It doesn’t remove the needs the tool was meeting.</p><p>So what happens when the phone disappears? The needs don’t vanish. They just sit there, unmet, creating pressure. You get bored and have nothing to reach for. You get anxious and have no quick relief. You feel disconnected and have no way to check in.</p><p>A detox creates a need vacuum. Vacuums get refilled.</p><p>Usually by the same thing you took away—because it was the most efficient solution you had. The phone wasn’t the disease. It was doing unpaid labor. And when you fired it without hiring a replacement, the job didn’t disappear. It just went unfilled until you broke.</p><h2 id=\"reason-2-detoxes-dont-change-the-environment-you-return-to\">Reason #2: Detoxes Don’t Change the Environment You Return To</h2>\n<p>Here’s the part most detox advice ignores: when the detox ends, you go back to the same system.</p><p>Same home screen. Same notification settings. Same infinite feeds. Same apps arranged the same way, optimized by the same teams to capture attention and never let go. The environment that created the problem is sitting there, unchanged, waiting.</p><p>A break from a system isn’t the same as a redesign of it.</p><p>You took a vacation from the machine. The machine didn’t take a vacation from being a machine. So when you return—rested, maybe, but structurally unchanged—the old patterns reassert themselves almost immediately. The cues fire. The loops restart. The defaults win.</p><p>This is why “30-day detox” logic collapses. Thirty days away from a system you haven’t changed is just thirty days of delayed reentry. The system doesn’t care how long you were gone.</p><h2 id=\"reason-3-detoxes-rely-on-identity-not-infrastructure\">Reason #3: Detoxes Rely on Identity, Not Infrastructure</h2>\n<p>Detoxes work by adopting a temporary identity. “I’m doing a detox.” “I don’t use my phone right now.” “I’m taking a break.”</p><p>That identity feels solid—until it isn’t. Identity-based restraint is fragile under stress. When you’re tired, overwhelmed, emotionally flooded, or just having a bad day, the identity cracks. You reach for the phone not because you forgot you were detoxing, but because the part of you that was holding the identity got overrun by something louder.</p><p>Infrastructure doesn’t crack under stress. It just runs.</p><p>If the phone is in another room, you still have to get up to check it—even on your worst day. If the apps are logged out, you still have to log back in—even when you’re exhausted. If the feed has a built-in stopping point, it still stops—even when your willpower is gone.</p><p>Eventually, life happens. Identity snaps. Infrastructure holds—or doesn’t.</p><p>Detoxes bet everything on identity. That’s why they fade.</p><h2 id=\"what-actually-lasts\">What Actually Lasts</h2>\n<p>Lasting change doesn’t come from taking breaks. It comes from altering the structure you return to.</p><p>That means fewer jobs assigned to the phone—so it’s not the answer to every micro-question your day generates. It means altered defaults, not heroic restraint—so the environment supports the behavior instead of fighting it. It means repeated exposure to boredom without panic—so you build tolerance instead of just avoiding the feeling. It means systems that survive bad days—because bad days are when everything gets tested.</p><p>The goal isn’t to use your phone less. It’s to make overuse harder and less useful.</p><p>That’s a different project than a detox. Detoxes are subtraction. Lasting change is subtraction plus substitution plus structure.</p><p>Subtraction: removing specific high-cost uses—the apps that pull you in reflexively, the loops that never end, the notifications that hijack attention.</p><p>Substitution: relocating regulation elsewhere—so when you need to manage a feeling, the phone isn’t the only tool in the drawer.</p><p>Structure: locking in the change with defaults—so the new behavior runs automatically instead of requiring daily willpower.</p><p>Detoxes only do subtraction. And temporarily. That’s why they don’t last.</p><h2 id=\"what-a-successful-detox-actually-looks-like\">What a “Successful Detox” Actually Looks Like</h2>\n<p>If you’ve done a detox and “failed,” it might be worth reframing what success means.</p><p>A successful detox isn’t thirty perfect days. It isn’t zero slips. It isn’t white-knuckling through until you can finally use your phone again.</p><p>A successful detox is returning to a different setup than you left. It’s noticing the phone feels slightly less magnetic. It’s finding that use has edges again—that you can pick it up and put it down without the loop pulling you back in. It’s discovering that relapse costs less and teaches more, because you’ve learned something about what roles the phone was playing.</p><p>If nothing changed structurally, the detox didn’t fail—it just ended.</p><h2 id=\"the-verdict\">The Verdict</h2>\n<p>Detoxes aren’t useless. They’re diagnostic.</p><p>A detox can show you what roles the phone is playing—which needs surface when it’s gone, which feelings become intolerable, which parts of your life were being papered over by stimulation. That’s valuable information.</p><p>But diagnosis isn’t cure. Revealing the problem isn’t the same as solving it.</p><p>Lasting change comes from redesigning the roles—not from periodic vacations that leave the system intact.</p><p>Breaks can reveal the problem. Only systems solve it.</p><hr>\n<p>This is why I built <a href=\"https://deftdraft.com/unplug/\">Unplug Your Brain</a>—not a detox, but a redesign. A system for changing your defaults so the change survives your worst days.</p>",
            "image": "https://deftdraft.com/blog/media/posts/3/screen-detoxes-dont-last.png",
            "author": {
                "name": "Matt L"
            },
            "tags": [
            ],
            "date_published": "2026-01-08T00:01:57-06:00",
            "date_modified": "2026-01-08T00:02:09-06:00"
        },
        {
            "id": "https://deftdraft.com/blog/how-to-break-a-phone-addiction-without-going-cold-turkey/",
            "url": "https://deftdraft.com/blog/how-to-break-a-phone-addiction-without-going-cold-turkey/",
            "title": "How to Break a Phone Addiction Without Going Cold Turkey",
            "summary": "Most people think there are only two options: quit completely or stay stuck forever. Cold turkey sounds decisive. It feels like taking control. You delete the apps, lock the phone in a drawer, announce to yourself that this time will be different. Then your boss&hellip;",
            "content_html": "<p>Most people think there are only two options: quit completely or stay stuck forever.</p><p>Cold turkey sounds decisive. It feels like taking control. You delete the apps, lock the phone in a drawer, announce to yourself that this time will be different.</p><p>Then your boss texts. Or you need directions. Or you’re waiting somewhere and the silence gets loud enough that you cave—not because you’re weak, but because the phone was doing six jobs and you just fired it from all of them at once.</p><p>Abrupt removal works for substances. Phones aren’t substances. They’re infrastructure.</p><p>This isn’t about quitting. It’s about disentangling.</p><h2 id=\"why-cold-turkey-backfires-for-phones\">Why Cold Turkey Backfires for Phones</h2>\n<p>The addiction model assumes you can remove the problem and heal. That works when the problem is a substance your body doesn’t need. It doesn’t work when the “problem” is embedded in your work, your relationships, your navigation, your calendar, your sense of where you’re supposed to be and when.</p><p>You don’t relapse because you’re weak. You reintroduce the phone because your life still runs on it.</p><p>Delete Instagram and you lose touch with friends who only communicate there. Turn off notifications and you miss the text about picking up your kid. Lock it in another room and you can’t check if the meeting got moved.</p><p>Cold turkey creates stress spikes with no replacement pathways. You’re not removing a vice. You’re amputating a limb you still need.</p><p>Cold turkey treats the phone as the problem. In reality, the phone is doing too many jobs.</p><h2 id=\"the-real-goal-fewer-jobs-not-zero-use\">The Real Goal: Fewer Jobs, Not Zero Use</h2>\n<p>The objective isn’t less screen time. It isn’t more discipline. It’s unbundling.</p><p>Right now, your phone handles stimulation, regulation, connection, escape, default filler, and sometimes actual work. One object. All of it. No wonder you keep reaching for it—it’s the answer to almost every micro-question your day generates.</p><p>Bored? Phone. Anxious? Phone. Waiting? Phone. Avoiding something? Phone. Need to know the weather? Phone. Need to feel less alone? Phone.</p><p>As long as one device does all of that, you’ll keep picking it up. The problem isn’t that you use it. The problem is that it’s fused to everything.</p><p>You’re not trying to quit your phone. You’re trying to fire it from a few roles.</p><h2 id=\"the-three-types-of-phone-use\">The Three Types of Phone Use</h2>\n<p>Not all phone use is the same, and lumping it together is why most strategies fail.</p><p>There’s intentional use—you pick it up for a clear purpose, do the thing, and put it down. Check a flight time. Reply to a specific message. Look up an address.</p><p>There’s reflexive use—you pick it up without deciding. You’re not even sure why it’s in your hand. The reach happened before the thought.</p><p>And there’s regulatory use—you pick it up to change how you feel. Bored, anxious, restless, sad, understimulated. The phone becomes mood management.</p><p>The mistake most people make is attacking all three at once. They try to reduce total use across the board and wonder why it feels impossible.</p><p>The strategy that actually works: leave intentional use alone. Target reflexive and regulatory use first.</p><p>This instantly lowers resistance. You’re not banning the phone. You’re not white-knuckling through every urge. You’re narrowing focus to the uses that cost the most and deliver the least.</p><h2 id=\"why-gradual-works-when-cold-turkey-doesnt\">Why Gradual Works When Cold Turkey Doesn’t</h2>\n<p>Gradual change isn’t about going slow. It’s about changing the order of operations.</p><p>Cold turkey says: remove first, adjust later. That’s backwards. The phone is regulating you. Take it away before you have other regulation pathways and you’re not solving the problem—you’re just creating a vacuum that will suck you back.</p><p>Gradual reduction works because habits weaken when their cues lose reliability. Every time you add friction to a reflexive reach and don’t complete the action, the neural pathway gets a little less automatic. You’re not fighting the urge. You’re degrading it.</p><p>It also works because regulation needs substitutes before removal. If the phone is how you manage discomfort, you can’t just delete the coping mechanism. You have to build another one first—or at least have something to fall back on that isn’t infinite scroll.</p><p>And it works because friction gives consciousness time to intervene. The reach happens faster than thought. Slow it down by even a few seconds and the automatic becomes a choice.</p><h2 id=\"design-moves-not-willpower-promises\">Design Moves, Not Willpower Promises</h2>\n<p>The shift isn’t about trying harder. It’s about changing what you’re trying.</p><p>These aren’t steps. They’re leverage points—places where small structural changes create disproportionate results.</p><p>Create phone-free contexts instead of a phone-free life. You don’t need to be away from it all day—you need specific times or places where the phone doesn’t come. Meals. The first hour awake. The bedroom after a certain time. Small containers of separation that don’t require global discipline.</p><p>Move regulation elsewhere before restricting stimulation. If you’re using the phone to manage stress, find one other thing that does that—even partially. A walk. A book. Staring out a window. The goal isn’t to become a monk. The goal is to have more than one tool in the drawer so the phone isn’t the only option.</p><p>Add friction selectively, not globally. You don’t need to make everything harder—just the pathways that lead to reflexive use. Move the apps that pull you in off the home screen. Charge the phone in another room at night. Log out of the thing you open without thinking. Small obstacles that give the automatic reach time to become a conscious decision.</p><p>Shrink infinity before you reduce frequency. Infinite scroll is the engine. If you can’t stop using an app, the app is probably designed to never end. Find the setting that limits how much content loads. Use a version that has edges. The loop breaks faster when it actually stops somewhere.</p><p>You don’t break habits by fighting urges. You break them by making the urge unreliable.</p><h2 id=\"what-progress-actually-feels-like\">What Progress Actually Feels Like</h2>\n<p>Progress doesn’t feel like victory. Not at first.</p><p>You’ll still use your phone. But you’ll notice the reach before completing it more often. The grab will start to feel like a question instead of an answer.</p><p>The phone will begin to feel slightly less necessary. Not unnecessary—just less fused. More like a tool, less like an extension of your nervous system.</p><p>At some point, the question shifts. It stops being “How do I stop?” and becomes “Who’s initiating this—me or the environment?” That’s the real change. Not usage stats. Authorship.</p><p>Boredom will increase. This is normal. It’s not a sign of failure. It’s a sign that you were using stimulation to cover over empty space, and now the empty space is showing up. That’s uncomfortable, but it stabilizes. The restlessness passes. What’s left is something quieter.</p><p>Feeling restless doesn’t mean it’s failing. It means regulation is relocating.</p><h2 id=\"common-failure-modes\">Common Failure Modes</h2>\n<p>A few things will feel like failure but aren’t. Most people quit here because they mistake turbulence for proof the system doesn’t work.</p><p>“I still use it, so nothing changed.” Wrong frame. The goal isn’t zero use. It’s more intentional use. If you’re reaching less automatically, something changed—even if the total hours look similar.</p><p>“This feels worse before it feels better.” That’s how it works. You’re removing a regulation shortcut. Of course there’s turbulence. The question isn’t whether it’s comfortable. It’s whether you’re building something sturdier underneath.</p><p>“I slipped, so the system doesn’t work.” Slipping is part of the system. The structure isn’t supposed to be airtight—it’s supposed to be recoverable. A slip isn’t a reset. It’s data. What triggered it? What was missing? Adjust and keep going.</p><p>Behavior follows structure. If the behavior isn’t changing, adjust the structure—not the willpower budget.</p><h2 id=\"what-youre-actually-aiming-for\">What You’re Actually Aiming For</h2>\n<p>The destination isn’t monk-like restraint. It isn’t zero screen time. It isn’t some permanent state of calm focus.</p><p>The destination is: the phone becomes a tool again, not a reflex. You decide more often than the environment decides for you. Silence becomes tolerable. Use has edges again.</p><p>You might still pick it up a lot. But you’ll know why. And when you don’t know why, you’ll notice—and that noticing will mean something.</p><p>Freedom isn’t never picking up your phone. It’s not being dragged there.</p><h2 id=\"where-this-leads\">Where This Leads</h2>\n<p>You didn’t cause this. The phone was designed to capture attention, and it’s doing exactly what it was built to do. Expecting yourself to out-willpower a billion-dollar system was never realistic.</p><p>Willpower won’t fix it. Design can.</p><p>This is the framework I wish I’d had when “just quit” kept failing. I built <a href=\"https://deftdraft.com/unplug/\">Unplug Your Brain</a> for exactly that—a system for breaking free from screens without abstinence theology, guilt trips, or pretending you don’t live in the real world.</p>",
            "image": "https://deftdraft.com/blog/media/posts/2/break-phone-addiction.png",
            "author": {
                "name": "Matt L"
            },
            "tags": [
            ],
            "date_published": "2026-01-07T23:53:08-06:00",
            "date_modified": "2026-01-07T23:53:08-06:00"
        },
        {
            "id": "https://deftdraft.com/blog/why-you-cant-put-your-phone-down-even-when-you-want-to/",
            "url": "https://deftdraft.com/blog/why-you-cant-put-your-phone-down-even-when-you-want-to/",
            "title": "Why You Can&#x27;t Put Your Phone Down (Even When You Want To)",
            "summary": "You didn’t decide to pick up your phone. You just noticed it was already in your hand. Maybe you were waiting for water to boil. Maybe you sat down after a long day and reached for it before your back hit the cushion. Maybe you&hellip;",
            "content_html": "<p>You didn’t decide to pick up your phone. You just noticed it was already in your hand.</p><p>Maybe you were waiting for water to boil. Maybe you sat down after a long day and reached for it before your back hit the cushion. Maybe you unlocked it, checked nothing, locked it, and unlocked it again four seconds later.</p><p>The strange part isn’t that you use your phone a lot. It’s that you use it when you don’t want to. You’ve told yourself to put it down. You’ve meant it. And somehow you’re still scrolling at midnight, not because you’re enjoying it, but because stopping feels like it requires something you can’t quite access.</p><p>This isn’t dramatic. It’s ambient. A low hum of compulsion that doesn’t announce itself. You’re not bingeing—you’re just never quite done.</p><p>If that sounds familiar, you’re not alone. And you’re not broken. But you’ve probably been given the wrong explanation for what’s happening.</p><h2 id=\"the-story-youve-been-told\">The Story You’ve Been Told</h2>\n<p>The common explanation goes like this: You’re addicted. You lack discipline. You need to set limits, delete apps, use grayscale, try harder.</p><p>And you’ve probably tried. Screen time limits that you bypass. App deletions that last three days. Promises to yourself that dissolve the first time you’re bored or stressed or waiting in line.</p><p>So you conclude that you’re the problem. Weak-willed. Easily distracted. Bad at follow-through.</p><p>Here’s the thing: if wanting to stop were enough, you would have stopped already.</p><p>You don’t keep scrolling because you lack desire to quit. You keep scrolling because desire isn’t the bottleneck. Something else is running the show.</p><h2 id=\"whats-actually-happening\">What’s Actually Happening</h2>\n<p>Your phone isn’t just a device. It’s a closed-loop system engineered to capture attention and never return it.</p><p>This isn’t a conspiracy theory. It’s the business model. The longer you stay, the more ads you see. The more you check, the more data you generate. Every app on your home screen has a team of engineers whose job is to make sure you come back.</p><p>Here’s how the loop works:</p><p><strong>Variable reward.</strong> You don’t know what you’ll find when you open an app. Maybe something interesting. Maybe nothing. That uncertainty is the hook. Predictable rewards are easy to walk away from. Unpredictable ones keep you pulling the lever.</p><p><strong>Intermittent reinforcement.</strong> Sometimes you get a like, a message, a notification that matters. Most of the time you don’t. But the occasional hit trains your brain to keep checking—just in case.</p><p><strong>Zero friction.</strong> There’s no barrier between the urge and the action. The phone is always within reach. Unlocking takes less than a second. You’re scrolling before you’ve consciously decided to scroll.</p><p><strong>No stopping cues.</strong> A book has a chapter end. A TV show has credits. Your phone has infinite scroll. There’s no natural signal that says “this is a good place to stop.” So you don’t.</p><p><strong>No recovery time.</strong> The next piece of content loads before you’ve processed the last one. Your brain never catches up. You’re not even really absorbing what you’re seeing—you’re just moving through it.</p><p>This isn’t dopamine hijacking your brain in some exotic way. Dopamine is doing exactly what it’s supposed to do: respond to cues that predict reward. The problem is you’re carrying a device that generates those cues constantly, in an environment that never turns off.</p><p>You’re not fighting a craving. You’re inside a machine that never resolves.</p><p>None of this is your fault. But here’s the uncomfortable part: leaving it unchallenged is still a decision. Just one you’re making passively, by default, every time you don’t change the structure. The system put you here. Staying is on you.</p><h2 id=\"why-knowing-this-doesnt-fix-it\">Why Knowing This Doesn’t Fix It</h2>\n<p>Here’s the uncomfortable part: understanding the mechanism doesn’t disable it.</p><p>You can know exactly how variable reward works and still find yourself checking your phone for no reason. You can read every book on attention and still lose an hour to nothing.</p><p>Why?</p><p>Because the cue-to-action pathway is faster than conscious thought. By the time you’re aware of what you’re doing, you’re already doing it. The reach happens before the decision.</p><p>And it’s not just boredom that triggers it. Micro-stress. Uncertainty. A slight dip in mood. The phone has become your default regulation tool—not because you chose it, but because it was always there, always available, always ready to smooth over any moment of discomfort.</p><p>Awareness helps with shame. It doesn’t fix behavior.</p><p>The problem isn’t that the loop exists. It’s that it runs by default.</p><h2 id=\"what-its-actually-costing-you\">What It’s Actually Costing You</h2>\n<p>The obvious costs are easy to name. Productivity. Sleep. Attention span.</p><p>But the deeper losses are quieter.</p><p>You’ve lost the ability to sit in an unresolved state. The moment something feels uncertain or uncomfortable, you reach. Not because the phone helps—but because reaching is what you do now.</p><p>You’ve lost friction that used to signal stopping. There’s no natural pause between activities anymore. Everything bleeds together in a stream of micro-inputs.</p><p>You’ve lost “nothing moments.” The small gaps where your mind used to wander, process, integrate. Those are gone. Every seam in your day has been caulked with content.</p><p>And maybe worst of all: you’ve lost authorship. You start to do something, and by the time you look up, you’re not sure what it was. The phone didn’t distract you from your life—it inserted itself into the steering. Every time you reach without deciding, something else is choosing for you. Not dramatically. Not maliciously. Just constantly. You’re not living less. You’re living on autopilot, with your hand on a wheel that’s already turning.</p><h2 id=\"why-just-quit-doesnt-work\">Why “Just Quit” Doesn’t Work</h2>\n<p>You’ve probably tried to white-knuckle it. Willpower your way out. Delete the apps, lock the phone in a drawer, go cold turkey for a week.</p><p>And maybe it worked for a few days. Then something stressful happened, or you got bored, or you just forgot—and you were back.</p><p>Here’s why removal alone fails: it creates withdrawal without replacement.</p><p>The phone wasn’t just wasting your time. It was solving a problem. It was regulating your mood. Filling the gaps. Giving you something to do with your hands and your attention when you didn’t know what else to do.</p><p>Take it away, and the underlying need doesn’t disappear. It just sits there, unmet, until you cave.</p><p>The phone wasn’t the cause. It was the solution that worked too well.</p><h2 id=\"what-actually-works\">What Actually Works</h2>\n<p>This isn’t where I give you a list of tricks. Tricks don’t work. You’ve already tried tricks.</p><p>What works is changing the structure. Not fighting the loop—redesigning it.</p><p><strong>Add friction where none exists.</strong> If your phone lives on the coffee table, the grab is reflexive. If it lives in another room, the grab has to negotiate with your feet. You don’t need to make it impossible—just slow enough that the automatic becomes conscious.</p><p><strong>Reintroduce stopping cues.</strong> A timer that ends a session is different from an app that never ends itself. The environment won’t give you an endpoint. Build one. Time-based, task-based, location-based. Something that says “this is done” before infinity scroll says otherwise.</p><p><strong>Separate regulation from stimulation.</strong> If the phone is how you calm down, taking it away feels like taking away oxygen. The fix isn’t to stop needing regulation—it’s to have more than one way to get it. So the phone isn’t the only tool in the drawer.</p><p><strong>Change your defaults instead of making promises.</strong> Willpower is a resource. It runs out. Defaults don’t require willpower. They just run.</p><p>You don’t need more restraint. You need different defaults.</p><h2 id=\"youre-not-broken\">You’re Not Broken</h2>\n<p>Your brain isn’t weak. Your phone isn’t evil. You’re responding normally to an abnormal environment.</p><p>The device in your pocket is the most sophisticated attention-capture tool ever built, refined by billions of dollars and decades of behavioral research. Expecting yourself to resist it through sheer will is like expecting to outrun a car.</p><p>You’re not lazy. You’re not addicted. You’re just operating without a system in an environment that has one.</p><p>The good news: environments can be changed. Defaults can be rewritten. You don’t have to win a war against yourself. You just have to stop fighting on their terms.</p><p>If self-control were the fix, you would have fixed it years ago.</p><hr>\n<p>This is why I built <a href=\"https://deftdraft.com/unplug/\">Unplug Your Brain</a>—a system for breaking free from screens without willpower, without going cold turkey, and without pretending you don’t live in the real world.</p>",
            "image": "https://deftdraft.com/blog/media/posts/1/why-you-cant-put-your-phone-down-infinite.png",
            "author": {
                "name": "Matt L"
            },
            "tags": [
            ],
            "date_published": "2026-01-07T23:36:05-06:00",
            "date_modified": "2026-01-08T00:02:04-06:00"
        }
    ]
}
